# однострочный комментарий

# "ctrl+/" - сочетание клавиш для однострочного комментария
# "ctrl+j" - открвть/закрыть терминал

# print("qwerty")
# print("SAL1")
# print("hello world")

'''какой-то
многострочный
комментарий'''

"""это
тоже 
многострочный
комментарий"""

# Переменные

# snake_case (змеиная_нотация-название переменных)
var_1 = 100
number_of_apples = 10

# camelCase (верблюжаяНотация)
numberOfBananas = 20

# константы (все буквы заглавными буквами)
CONST_VAR = 1000

# print(var_1)


# вызов встроенной функции вывода в терминал (команда "print")
# print(numberOfBananas, CONST_VAR, number_of_apples)

# встроенная функция ввода из терминала (команда "input")
# my_input = input("Введите что-то: ")

# print("вы ввели вот это", my_input)


# небольшой калькулятор

# num_1 = input("Введите первое число: ")
# num_2 = input("Введите второе число: ")

# # конкатенация строк
# result = num_1 + num_2

# # конвертация данных
# # str -> int
# result = int(num_1) + int(num_2)

# print("результат =", result)

